Revit 2020 API
PathOfTravel.PathMidpoint Property
 The midpoint of the path. The Z coordinate is always zero.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2020
Syntax
C#
public XYZ PathMidpoint { get; }
Visual Basic
Public ReadOnly Property PathMidpoint As XYZ
	Get
Visual C++
public:
property XYZ^ PathMidpoint {
	XYZ^ get ();
}
See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace